03_Training/3.1_CLUSTERING/PH_gen100_pop100_symUVKRxy_parIs/running_template/eval_template/PH_2D_RANS_kOmegaSSTx/Allrun
#!/bin/sh

# Load OpenFOAM v2.4
source /usr/local/module/spartan_old.sh
module load OpenFOAM/2.4.0-intel-2017.u2
source $FOAM_BASH

# Add library path
export LD_LIBRARY_PATH=/scratch/punim0394/PERIODICHILL/02_Training/OpenFOAM/lib:$LD_LIBRARY_PATH

# Decompose case
#decomposePar > log.decomposePar

# Launch OpenFOAM solver
#mpirun -np 4 /scratch/punim0394/PERIODICHILL/02_Training/OpenFOAM/bin/simpleFoamx -parallel > log.simpleFoamx
/scratch/punim0394/PERIODICHILL/02_Training/OpenFOAM/bin/simpleFoamx > log.simpleFoamx

# Reconstruct case
#reconstructPar > log.reconstructPar

# Postprocessing
sample > log.sample

# Remove multi-processing folders
#rm -r processor*
