03_Training/3.1_CLUSTERING/PH_gen100_pop100_symUVKRxy_parIs/running_template/eval_template/PH_2D_RANS_kOmegaSSTx/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libsampling.so");

type sets;

setFormat raw; //csv;

interpolationScheme cellPoint;

fields
(
    U
    k
    R
);

sets
(
    cluster0
    {
        type cloud;
        axis xyz;
        points (#include "cluster0.H");
        ordered false;
        interpolate false;
    }   
    cluster1
    {
        type cloud;
        axis xyz;
        points (#include "cluster1.H");
        ordered false;
        interpolate false;
    }   
    cluster2
    {
        type cloud;
        axis xyz;
        points (#include "cluster2.H");
        ordered false;
        interpolate false;
    }   

//    X0H
//    {
//        type        face;
//        axis        y;
//
//        start       (0.05 0 0);
//        end         (0.05 5 0);
//    }
//    
//    X05H
//    {
//        type        face;
//        axis        y;
//
//        start       (0.5 0 0);
//        end         (0.5 5 0);
//    }
//
//    X1H
//    {
//        type        face;
//        axis        y;
//
//        start       (1 0 0);
//        end         (1 5 0);
//    }
//
//    X2H
//    {
//        type        face;
//        axis        y;
//
//        start       (2 0 0);
//        end         (2 5 0);
//    }
//    
//    X3H
//    {
//        type        face;
//        axis        y;
//
//        start       (3 0 0);
//        end         (3 5 0);
//    }
//
//    X4H
//    {
//        type        face;
//        axis        y;
//
//        start       (4 0 0);
//        end         (4 5 0);
//    }
//
//    X5H
//    {
//        type        face;
//        axis        y;
//
//        start       (5 0 0);
//        end         (5 5 0);
//    }
//
//    X6H
//    {
//        type        face;
//        axis        y;
//
//        start       (6 0 0);
//        end         (6 5 0);
//    }
//
//    X7H
//    {
//        type        face;
//        axis        y;
//
//        start       (7 0 0);
//        end         (7 5 0);
//    }
//
//    X8H
//    {
//        type        face;
//        axis        y;
//
//        start       (8 0 0);
//        end         (8 5 0);
//    }
   
);

// *********************************************************************** //
